Revit 2027 API
BuiltInFailures.SketchFailures.RebarManyLoopsError Property
 Rebar Sketch contains more than one loop. Can't create Rebar.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId RebarManyLoopsError { get; }
Public Shared ReadOnly Property RebarManyLoopsError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ RebarManyLoopsError {
	FailureDefinitionId^ get ();
}
static member RebarManyLoopsError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace